_emacs.d/init/init-cc.org
#+TITLE:    Modern C++ IDE for Emacs
#+AUTHOR:   Zuogong Yue
#+EMAIL:    oracleyue@gmail.com
#+DATE:     20 Apr 2018
#+STARTUP:  indent
#+OPTIONS:  H:6 num:t toc:t ^:nil _:nil \n:nil LaTeX:t


* Notes  for C/C++ Environments                                    :noexport:

*Warning*:
- =semantic-mode= in CEDET causes ~M-x gdb~ freeze Emacs on OSX

*Features* (using =helm=):
- use =C-c h i= to show symbol reference table
- create =.dir-local.el= to enable completion for local codes
- use helm-projectile to browse files in project
    - =C-c p a= to switch between .h, .c and .cpp
    - jump to =f= (file); =d= (directory); =b= (buffer); =e= (recent files)
    - grep in project: =C-c p g s=
    - multi-occur in project buffers: =C-c p o=
- use helm-gtags to jump via tags
    - use =C-c g c= create tags first and =C-c g u= to update
    - use =M-.= and =M-,= to jump and jump back (see more in =init-tags.el=)

*Obsolete alternatives*:
Other configurations for C++ programming environment located in
=./unmaintained/=:
- =init-cc-clang.el= : use =company-mode= and =company-clang= for completion
- =init-cc-ac.el= : use =auto-complete-mode= and =clang-complete-async=


* Modern C++ IDE for Emacs

  Features:
  - use *rtags* for code navigation (if enable by =*enable-rtags*= in =init-features.el=)
  - use *irony-mode*, *rtags* for code completion (use *company* as ac-engine)
  - integrate *flycheck* with *rtags* (disabled) and *irony*
  - use *cmake-ide* to integrate cmake-based projects
  - use *helm-make* as alternative compilation

** Requirements
*** install software in OS
1. use =pip= to install =cpplint= for *google-cpp-style*

2. have *cmake* installed

3. install *clang/LLVM*: ~brew install llvm~

4. compile *irony-server*
   - make a clean build directory
   - run ~cmake -DCMAKE_PREFIX_PATH=/usr/local/Cellar/llvm/5.0.0/ -DCMAKE_INSTALL_RPATH_USE_LINK_PATH=ON ~/.emacs.d/elpa/irony-20170828.1218/server/~
   - build and run ~make && ./bin/irony-server --version~
   - copy =./bin/irony-server= under your =.emacs.d/bin=

5. compile *rtags* servers (see RTags section)

*** install packages in emacs

  #+BEGIN_SRC emacs-lisp
    ; =====================================================
    ;; Programming Environment for C/C++ (modern)
    ; =====================================================

  #+END_SRC

  Install the additional packages to support the modern C/C++ environment.
  Since we change to use =use-package=, the following header is no longer
  needed.

  #+BEGIN_SRC
    ;; check and install essential pkgs
    (setq custom/modern-cc-packages
          '(;irony
            ;company-irony
            ;company-irony-c-headers
            ;flycheck-irony
            ;irony-eldoc
            ;cmake-ide
            ))
    ;; (when *enable-rtags*
    ;;   (setq custom/modern-cc-packages
    ;;         (append
    ;;          '(rtags
    ;;            company-rtags
    ;;            flycheck-rtags)
    ;;          custom/modern-cc-packages)))
    (custom/install-packages custom/modern-cc-packages)
  #+END_SRC

** C++ Coding styles
*** Default style for C/C++

    #+BEGIN_SRC emacs-lisp
      (require 'cc-mode)
      (setq-default c-default-style "linux")
      (setq-default c-basic-offset 4)
    #+END_SRC

*** Basic edit enhancement for C/C++
**** Auto insert pair of symbols using smartparens
     Install =smartparens= mode and enable it by ~(require 'smartparens)~, which has been enabled in =.emacs= globally.

     #+BEGIN_SRC emacs-lisp
       ;; /smartparens/: insert pair of symbols
       ;; when you press RET, the curly braces automatically add another newline
       (sp-with-modes '(c-mode c++-mode)
         (sp-local-pair "{" nil :post-handlers '(("||\n[i]" "RET")))
         (sp-local-pair "/*" "*/" :post-handlers '(("| " "SPC") ("* ||\n[i]" "RET"))))
     #+END_SRC

