_emacs.d/init/readme/init-cc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-05-03 Thu 22:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Modern C++ IDE for Emacs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Zuogong Yue" />
<link rel="stylesheet" type="text/css" media="all" href="/Users/oracleyue/.emacs.d/templates/css/bootstrap.min.css" />
<link rel="stylesheet" type="text/css" media="all" href="/Users/oracleyue/.emacs.d/templates/css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Modern C++ IDE for Emacs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org01a4261">1. Modern C++ IDE for Emacs</a>
<ul>
<li><a href="#orgdae21f8">1.1. Requirements</a>
<ul>
<li><a href="#org501363f">1.1.1. install software in OS</a></li>
<li><a href="#orge46bcf4">1.1.2. install packages in emacs</a></li>
</ul>
</li>
<li><a href="#org400f355">1.2. C++ Coding styles</a>
<ul>
<li><a href="#orge506e2a">1.2.1. Default style for C/C++</a></li>
<li><a href="#org33d9e27">1.2.2. Basic edit enhancement for C/C++</a>
<ul>
<li><a href="#org8fabed5">1.2.2.1. Auto insert pair of symbols using smartparens</a></li>
</ul>
</li>
<li><a href="#orgf931da0">1.2.3. Google C++ style and its flymake checker</a></li>
</ul>
</li>
<li><a href="#org8d36b1e">1.3. Source code navigation using RTags</a>
<ul>
<li><a href="#org19247b3">1.3.1. Install rtags servers in OS</a></li>
<li><a href="#org8eb4613">1.3.2. Setup rtags packages in Emacs</a></li>
<li><a href="#orgefe790e">1.3.3. Use RTags for C/C++ projects</a></li>
<li><a href="#org193f29d">1.3.4. Usages</a>
<ul>
<li><a href="#org68aedcc">1.3.4.1. Basic movements</a></li>
<li><a href="#org330c1ce">1.3.4.2. Find definitions/references in project</a></li>
<li><a href="#org9ec3e09">1.3.4.3. Find files in project</a></li>
<li><a href="#org1ebfdd2">1.3.4.4. View visited tags with tag stack</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4e38293">1.4. Source code completion using Irony</a>
<ul>
<li><a href="#org9779620">1.4.1. Installations</a></li>
<li><a href="#org2878673">1.4.2. Setup</a></li>
<li><a href="#orgf60648b">1.4.3. Use Irony for C/C++ projects</a></li>
<li><a href="#orgd4f4e6e">1.4.4. Integrate Irony and Irony-c-headers in Company</a></li>
<li><a href="#org9cb3938">1.4.5. [optional] Integrate Irony in Ivy</a></li>
<li><a href="#org480e9b7">1.4.6. [disabled] Show eldoc for C/C++ mode via irony</a></li>
</ul>
</li>
<li><a href="#org40a865c">1.5. Syntax checking with Flycheck</a>
<ul>
<li><a href="#org81e0bab">1.5.1. Prerequisites</a></li>
<li><a href="#org5e5073a">1.5.2. [disabled] Integrating RTags with Flycheck</a></li>
<li><a href="#orgd91d03e">1.5.3. Integrating Irony with Flycheck</a></li>
<li><a href="#orgeb9292e">1.5.4. Keybindings</a></li>
</ul>
</li>
<li><a href="#org502513a">1.6. CMake automation with cmake-ide (disabled)</a>
<ul>
<li><a href="#org1699bbc">1.6.1. Prerequisites</a></li>
<li><a href="#org8357cbe">1.6.2. Using cmake-ide</a></li>
</ul>
</li>
<li><a href="#org46e36d4">1.7. More supports for C/C++ programming</a>
<ul>
<li><a href="#orgc5074eb">1.7.1. Symbol reference tables via function-args</a></li>
<li><a href="#orgbbeb805">1.7.2. Major modes to edit CMake files</a></li>
<li><a href="#orgb216c61">1.7.3. Compilation supports via helm-make</a></li>
<li><a href="#org03db091">1.7.4. Major modes for doxygen documentations (disabled)</a></li>
</ul>
</li>
<li><a href="#org895fe5e">1.8. Ends</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org01a4261" class="outline-2">
<h2 id="org01a4261"><span class="section-number-2">1</span> Modern C++ IDE for Emacs</h2>
<div class="outline-text-2" id="text-1">
<p>
Features:
</p>
<ul class="org-ul">
<li>use <b>rtags</b> for code navigation (if enable by <code>*enable-rtags*</code> in <code>init-features.el</code>)</li>
<li>use <b>irony-mode</b>, <b>rtags</b> for code completion (use <b>company</b> as ac-engine)</li>
<li>integrate <b>flycheck</b> with <b>rtags</b> (disabled) and <b>irony</b></li>
<li>use <b>cmake-ide</b> to integrate cmake-based projects</li>
<li>use <b>helm-make</b> as alternative compilation</li>
</ul>
</div>

<div id="outline-container-orgdae21f8" class="outline-3">
<h3 id="orgdae21f8"><span class="section-number-3">1.1</span> Requirements</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org501363f" class="outline-4">
<h4 id="org501363f"><span class="section-number-4">1.1.1</span> install software in OS</h4>
<div class="outline-text-4" id="text-1-1-1">
<ol class="org-ol">
<li>use <code>pip</code> to install <code>cpplint</code> for <b>google-cpp-style</b></li>

<li>have <b>cmake</b> installed</li>

<li>install <b>clang/LLVM</b>: <code>brew install llvm</code></li>

<li>compile <b>irony-server</b>
<ul class="org-ul">
<li>make a clean build directory</li>
<li>run <code>cmake -DCMAKE_PREFIX_PATH=/usr/local/Cellar/llvm/5.0.0/ -DCMAKE_INSTALL_RPATH_USE_LINK_PATH=ON ~/.emacs.d/elpa/irony-20170828.1218/server/</code></li>
<li>build and run <code>make &amp;&amp; ./bin/irony-server --version</code></li>
<li>copy <code>./bin/irony-server</code> under your <code>.emacs.d/bin</code></li>
</ul></li>

<li>compile <b>rtags</b> servers (see RTags section)</li>
</ol>
</div>
</div>

<div id="outline-container-orge46bcf4" class="outline-4">
<h4 id="orge46bcf4"><span class="section-number-4">1.1.2</span> install packages in emacs</h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5C6370;">; </span><span style="color: #5C6370;">=====================================================</span>
<span style="color: #5C6370;">;; </span><span style="color: #5C6370;">Programming Environment for C/C++ (modern)</span>
<span style="color: #5C6370;">; </span><span style="color: #5C6370;">=====================================================</span>

</pre>
</div>

<p>
Install the additional packages to support the modern C/C++ environment.
Since we change to use <code>use-package</code>, the following header is no longer
needed.
</p>

<pre class="example">
;; check and install essential pkgs
(setq custom/modern-cc-packages
      '(;irony
        ;company-irony
        ;company-irony-c-headers
        ;flycheck-irony
        ;irony-eldoc
        ;cmake-ide
        ))
;; (when *enable-rtags*
;;   (setq custom/modern-cc-packages
;;         (append
;;          '(rtags
;;            company-rtags
;;            flycheck-rtags)
;;          custom/modern-cc-packages)))
(unless (custom/packages-installed-p custom/modern-cc-packages)
  (package-refresh-contents)
  (dolist (pkg custom/modern-cc-packages)
    (unless (package-installed-p pkg)
      (package-install pkg))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org400f355" class="outline-3">
<h3 id="org400f355"><span class="section-number-3">1.2</span> C++ Coding styles</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orge506e2a" class="outline-4">
<h4 id="orge506e2a"><span class="section-number-4">1.2.1</span> Default style for C/C++</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #C678DD;">require</span> '<span style="color: #56B6C2;">cc-mode</span>)
(<span style="color: #C678DD;">setq-default</span> c-default-style <span style="color: #98C379;">"linux"</span>)
(<span style="color: #C678DD;">setq-default</span> c-basic-offset 4)
</pre>
</div>
</div>
</div>

<div id="outline-container-org33d9e27" class="outline-4">
<h4 id="org33d9e27"><span class="section-number-4">1.2.2</span> Basic edit enhancement for C/C++</h4>
<div class="outline-text-4" id="text-1-2-2">
</div>
<div id="outline-container-org8fabed5" class="outline-5">
<h5 id="org8fabed5"><span class="section-number-5">1.2.2.1</span> Auto insert pair of symbols using smartparens</h5>
<div class="outline-text-5" id="text-1-2-2-1">
<p>
Install <code>smartparens</code> mode and enable it by <code>(require 'smartparens)</code>, which has been enabled in <code>.emacs</code> globally.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5C6370;">;; </span><span style="color: #5C6370;">/smartparens/: insert pair of symbols</span>
<span style="color: #5C6370;">;; </span><span style="color: #5C6370;">when you press RET, the curly braces automatically add another newline</span>
(<span style="color: #C678DD;">sp-with-modes</span> '(c-mode c++-mode)
  (sp-local-pair <span style="color: #98C379;">"{"</span> nil <span style="color: #56B6C2;">:post-handlers</span> '((<span style="color: #98C379;">"||\n[i]"</span> <span style="color: #98C379;">"RET"</span>)))
  (sp-local-pair <span style="color: #98C379;">"/*"</span> <span style="color: #98C379;">"*/"</span> <span style="color: #56B6C2;">:post-handlers</span> '((<span style="color: #98C379;">"| "</span> <span style="color: #98C379;">"SPC"</span>) (<span style="color: #98C379;">"* ||\n[i]"</span> <span style="color: #98C379;">"RET"</span>))))
</pre>
</div>
</div>
</div>
</div>
