_emacs.d/init/init-cc.org
*** Google C++ style and its flymake checker
    Install =google-c-style= and =flymake-google-cpplint=.
    You also need to install Python package =cpplint= by =pip=.

    #+BEGIN_SRC emacs-lisp
      ;; /google-c-style/ and /flymake-google-cpplint/ style checker
      (when *enable-gg-cpp-style*
        (require 'google-c-style)
        (add-hook 'c-mode-common-hook 'google-set-c-style)
        (add-hook 'c-mode-common-hook 'google-make-newline-indent)
        (defun zyue/flymake-google-init ()
          (require 'flymake-google-cpplint)
          (setq flymake-google-cpplint-command
            (if (string-equal system-type "darwin")
                "/usr/local/bin/cpplint" "/usr/bin/cpplint"))
          (flymake-google-cpplint-load))
        (add-hook 'c-mode-hook 'zyue/flymake-google-init)
        (add-hook 'c++-mode-hook 'zyue/flymake-google-init))
    #+END_SRC

** Source code navigation using RTags
*** Install rtags servers in OS
Build and install RTags using the RTags Quickstart Guide. Alternatively install RTags using your distribution's package manager.

For OS X (due to the issues of duplicated clang's), compile as follows:
#+BEGIN_SRC sh
  git clone --recursive https://github.com/Andersbakken/rtags.git
  cd rtags
  mkdir build && cd build
  cmake -DCMAKE_EXPORT_COMPILE_COMMANDS=1 -DCMAKE_PREFIX_PATH=/usr/local/Cellar/llvm/5.0.0/ ..
  make
#+END_SRC
Put =rdm= and =rc= under your PATH.

*** Setup rtags packages in Emacs

We could use RTags for code navigation and code completions in C/C++
projects. However, one may easily find its deficiency on code completion. Thus
we use Irony-mode for code completion.

If you also want to use RTags for code completion, we could add =company-rtags=
to the =company-backends=.

#+BEGIN_SRC emacs-lisp
  (when *enable-rtags*
    ;; see the const *enable-rtags* defined in "init-features.el"
    (use-package rtags
      :config
      ;; run rtags server automatically
      (rtags-start-process-unless-running)
      (rtags-enable-standard-keybindings)
      ;; use rtags for code completions (not recommended)
      ;; (setq rtags-autostart-diagnostics t)
      ;; (setq rtags-completions-enabled t)
      ;; (use-package company-rtags
      ;;   :config
      ;;   (push 'company-rtags company-backends))
      ;; integration with helm
      (when *use-helm*
        (setq rtags-display-result-backend 'helm))))
#+END_SRC

*** Use RTags for C/C++ projects

To use RTags for CMake-based projects, I just create a =makefile=
in the project root:

#+BEGIN_SRC sh
  cmake:
      cd ./build && cmake -DCMAKE_EXPORT_COMPILE_COMMANDS=1 ..
#+END_SRC

The =-DCMAKE_EXPORT_COMPILE_COMMANDS=1= makes =compile_commands.json= to be
emitted during the actual compilation. This file describes the compilation flags
for every source file. These flags are essential in helping the parser
understand what's going on.

To use RTags we need to start =rdm= and index your project.  In the build
directory I start

#+BEGIN_SRC sh
  rdm & rc -J .
#+END_SRC

For other C++ projects which aren't CMake-based, use the excellent tool =bear=
to emit the =compile_commands.json= file. It's as easy as:

#+BEGIN_SRC sh
  $ make clean
  $ bear make
#+END_SRC

*** Usages
**** Basic movements

     =C-M-f= runs forward-sexp, move forward over a balanced expression that can be a pair or a symbol.
     =C-M-b= runs backward-sexp, move backward over a balanced expression that can be a pair or a symbol.
     =C-M-k= runs kill-sexp, kill balanced expression forward that can be a pair or a symbol.
     =C-M-<SPC>= or =C-M-@= runs mark-sexp, put mark after following expression that can be a pair or a symbol.
     =C-M-a= runs beginning-of-defun, which moves point to beginning of a function.
     =C-M-e= runs end-of-defun, which moves point to end of a function.
     =C-M-h= runs mark-defun, which put a region around whole current or following function.

**** Find definitions/references in project

     =C-c-r .= runs rtags-find-symbol-at-point, which jumps to the definition of the symbol under the cursor; press again to jump between definition and declaration.

     =C-c-r ,= runs rtags-find-references-at-point, which lists all references to the symbol under the cursor.

     =C-c-r <= runs rtags-find-references, which prompts for the symbol name and finds all references.
     =C-c-r >= runs rtags-find-symbol, which prompts for symbol name and finds all references.

     =C-c r I= gets a list of rtags-extracted symbols in the current file (*helm* also provides =helm-semantic-or-imenu=)

**** Find files in project

     =C-c r ;= runs rtags-find-file, which prompts for file name to search for out of currently indexed files.

     Alternatively, this can be better accomplished with Projectile.

**** View visited tags with tag stack

     =C-c r [= rtags-location-stack-back Jumps to last visited tag.
     =C-c r ]= rtags-location-stack-forward Moves forward in location stack.

** Source code completion using Irony
