_emacs.d/init/readme/init-cc.html

<div id="outline-container-orgf931da0" class="outline-4">
<h4 id="orgf931da0"><span class="section-number-4">1.2.3</span> Google C++ style and its flymake checker</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Install <code>google-c-style</code> and <code>flymake-google-cpplint</code>.
You also need to install Python package <code>cpplint</code> by <code>pip</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5C6370;">;; </span><span style="color: #5C6370;">/google-c-style/ and /flymake-google-cpplint/ style checker</span>
(<span style="color: #C678DD;">when</span> *enable-gg-cpp-style*
  (<span style="color: #C678DD;">require</span> '<span style="color: #56B6C2;">google-c-style</span>)
  (add-hook 'c-mode-common-hook 'google-set-c-style)
  (add-hook 'c-mode-common-hook 'google-make-newline-indent)
  (<span style="color: #C678DD;">defun</span> <span style="color: #61AFEF;">y:flymake-google-init</span> ()
    (<span style="color: #C678DD;">require</span> '<span style="color: #56B6C2;">flymake-google-cpplint</span>)
    (<span style="color: #C678DD;">setq</span> flymake-google-cpplint-command
      (<span style="color: #C678DD;">if</span> (string-equal system-type <span style="color: #98C379;">"darwin"</span>)
          <span style="color: #98C379;">"/usr/local/bin/cpplint"</span> <span style="color: #98C379;">"/usr/bin/cpplint"</span>))
    (flymake-google-cpplint-load))
  (add-hook 'c-mode-hook 'y:flymake-google-init)
  (add-hook 'c++-mode-hook 'y:flymake-google-init))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8d36b1e" class="outline-3">
<h3 id="org8d36b1e"><span class="section-number-3">1.3</span> Source code navigation using RTags</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org19247b3" class="outline-4">
<h4 id="org19247b3"><span class="section-number-4">1.3.1</span> Install rtags servers in OS</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Build and install RTags using the RTags Quickstart Guide. Alternatively install RTags using your distribution's package manager.
</p>

<p>
For OS X (due to the issues of duplicated clang's), compile as follows:
</p>
<div class="org-src-container">
<pre class="src src-sh">git clone --recursive https://github.com/Andersbakken/rtags.git
<span style="color: #56B6C2;">cd</span> rtags
mkdir build &amp;&amp; <span style="color: #56B6C2;">cd</span> build
cmake -DCMAKE_EXPORT_COMPILE_COMMANDS=1 -DCMAKE_PREFIX_PATH=/usr/local/Cellar/llvm/5.0.0/ ..
make
</pre>
</div>
<p>
Put <code>rdm</code> and <code>rc</code> under your PATH.
</p>
</div>
</div>

<div id="outline-container-org8eb4613" class="outline-4">
<h4 id="org8eb4613"><span class="section-number-4">1.3.2</span> Setup rtags packages in Emacs</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
We could use RTags for code navigation and code completions in C/C++
projects. However, one may easily find its deficiency on code completion. Thus
we use Irony-mode for code completion.
</p>

<p>
If you also want to use RTags for code completion, we could add <code>company-rtags</code>
to the <code>company-backends</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #C678DD;">when</span> *enable-rtags*
  <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">see the const *enable-rtags* defined in "init-features.el"</span>
  (<span style="color: #C678DD;">use-package</span> <span style="color: #56B6C2;">rtags</span>
    <span style="color: #56B6C2;">:config</span>
    <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">run rtags server automatically</span>
    (rtags-start-process-unless-running)
    (rtags-enable-standard-keybindings)
    <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">use rtags for code completions (not recommended)</span>
    <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">(setq rtags-autostart-diagnostics t)</span>
    <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">(setq rtags-completions-enabled t)</span>
    <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">(use-package company-rtags</span>
    <span style="color: #5C6370;">;;   </span><span style="color: #5C6370;">:config</span>
    <span style="color: #5C6370;">;;   </span><span style="color: #5C6370;">(push 'company-rtags company-backends))</span>
    <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">integration with helm</span>
    (<span style="color: #C678DD;">when</span> *use-helm*
      (<span style="color: #C678DD;">setq</span> rtags-display-result-backend 'helm))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgefe790e" class="outline-4">
<h4 id="orgefe790e"><span class="section-number-4">1.3.3</span> Use RTags for C/C++ projects</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
To use RTags for CMake-based projects, I just create a <code>makefile</code>
in the project root:
</p>

<div class="org-src-container">
<pre class="src src-sh">cmake:
    <span style="color: #56B6C2;">cd</span> ./build &amp;&amp; cmake -DCMAKE_EXPORT_COMPILE_COMMANDS=1 ..
</pre>
</div>

<p>
The <code>-DCMAKE_EXPORT_COMPILE_COMMANDS=1</code> makes <code>compile_commands.json</code> to be
emitted during the actual compilation. This file describes the compilation flags
for every source file. These flags are essential in helping the parser
understand what's going on.
</p>

<p>
To use RTags we need to start <code>rdm</code> and index your project.  In the build
directory I start
</p>

<div class="org-src-container">
<pre class="src src-sh">rdm &amp; rc -J .
</pre>
</div>

<p>
For other C++ projects which aren't CMake-based, use the excellent tool <code>bear</code>
to emit the <code>compile_commands.json</code> file. It's as easy as:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ make clean
$ bear make
</pre>
</div>
</div>
</div>

<div id="outline-container-org193f29d" class="outline-4">
<h4 id="org193f29d"><span class="section-number-4">1.3.4</span> Usages</h4>
<div class="outline-text-4" id="text-1-3-4">
</div>
<div id="outline-container-org68aedcc" class="outline-5">
<h5 id="org68aedcc"><span class="section-number-5">1.3.4.1</span> Basic movements</h5>
<div class="outline-text-5" id="text-1-3-4-1">
<p>
<code>C-M-f</code> runs forward-sexp, move forward over a balanced expression that can be a pair or a symbol.
<code>C-M-b</code> runs backward-sexp, move backward over a balanced expression that can be a pair or a symbol.
<code>C-M-k</code> runs kill-sexp, kill balanced expression forward that can be a pair or a symbol.
<code>C-M-&lt;SPC&gt;</code> or <code>C-M-@</code> runs mark-sexp, put mark after following expression that can be a pair or a symbol.
<code>C-M-a</code> runs beginning-of-defun, which moves point to beginning of a function.
<code>C-M-e</code> runs end-of-defun, which moves point to end of a function.
<code>C-M-h</code> runs mark-defun, which put a region around whole current or following function.
</p>
</div>
</div>

<div id="outline-container-org330c1ce" class="outline-5">
<h5 id="org330c1ce"><span class="section-number-5">1.3.4.2</span> Find definitions/references in project</h5>
<div class="outline-text-5" id="text-1-3-4-2">
<p>
<code>C-c-r .</code> runs rtags-find-symbol-at-point, which jumps to the definition of the symbol under the cursor; press again to jump between definition and declaration.
</p>

<p>
<code>C-c-r ,</code> runs rtags-find-references-at-point, which lists all references to the symbol under the cursor.
</p>

<p>
<code>C-c-r &lt;</code> runs rtags-find-references, which prompts for the symbol name and finds all references.
<code>C-c-r &gt;</code> runs rtags-find-symbol, which prompts for symbol name and finds all references.
</p>

<p>
<code>C-c r I</code> gets a list of rtags-extracted symbols in the current file (<b>helm</b> also provides <code>helm-semantic-or-imenu</code>)
</p>
</div>
</div>

<div id="outline-container-org9ec3e09" class="outline-5">
<h5 id="org9ec3e09"><span class="section-number-5">1.3.4.3</span> Find files in project</h5>
<div class="outline-text-5" id="text-1-3-4-3">
<p>
<code>C-c r ;</code> runs rtags-find-file, which prompts for file name to search for out of currently indexed files.
</p>

<p>
Alternatively, this can be better accomplished with Projectile.
</p>
</div>
</div>

<div id="outline-container-org1ebfdd2" class="outline-5">
<h5 id="org1ebfdd2"><span class="section-number-5">1.3.4.4</span> View visited tags with tag stack</h5>
<div class="outline-text-5" id="text-1-3-4-4">
<p>
<code>C-c r [</code> rtags-location-stack-back Jumps to last visited tag.
<code>C-c r ]</code> rtags-location-stack-forward Moves forward in location stack.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org4e38293" class="outline-3">
<h3 id="org4e38293"><span class="section-number-3">1.4</span> Source code completion using Irony</h3>
<div class="outline-text-3" id="text-1-4">
</div>
