_emacs.d/init/init-cc.el

;; /google-c-style/ and /flymake-google-cpplint/ style checker
(when *enable-gg-cpp-style*
  (require 'google-c-style)
  (add-hook 'c-mode-common-hook 'google-set-c-style)
  (add-hook 'c-mode-common-hook 'google-make-newline-indent)
  (defun zyue/flymake-google-init ()
    (require 'flymake-google-cpplint)
    (setq flymake-google-cpplint-command
      (if (string-equal system-type "darwin")
          "/usr/local/bin/cpplint" "/usr/bin/cpplint"))
    (flymake-google-cpplint-load))
  (add-hook 'c-mode-hook 'zyue/flymake-google-init)
  (add-hook 'c++-mode-hook 'zyue/flymake-google-init))

(when *enable-rtags*
  ;; see the const *enable-rtags* defined in "init-features.el"
  (use-package rtags
    :config
    ;; run rtags server automatically
    (rtags-start-process-unless-running)
    (rtags-enable-standard-keybindings)
    ;; use rtags for code completions (not recommended)
    ;; (setq rtags-autostart-diagnostics t)
    ;; (setq rtags-completions-enabled t)
    ;; (use-package company-rtags
    ;;   :config
    ;;   (push 'company-rtags company-backends))
    ;; integration with helm
    (when *use-helm*
      (setq rtags-display-result-backend 'helm))))

;; /irony/+/company-irony/: code completions
