_emacs.d/init/init-cc.org
*** Installations

*Mac OS X*:

Download a pre-compiled package from llvm.org to install =irony-server=.
(change the 4.0.1 version with the latest (the greatest!))

    - Download =clang+llvm-4.0.1-x86_64-apple-darwin.tar.xz= from http://llvm.org/releases/download.html

    - Extract it somewhere (e.g: =~/Programs/=) (Warning: you need to keep it on your computer to allow =irony-server= to work!)

    - make a clean build directory (e.g. ~cd ~/tmp && mkdir build && cd build~)

    - run
    #+BEGIN_SRC sh
      cmake -DCMAKE_PREFIX_PATH=/Users/oracleyue/Programs/clang+llvm-4.0.1-x86_64-apple-macosx10.9.0/ -DCMAKE_INSTALL_RPATH_USE_LINK_PATH=ON /Users/oracleyue/.emacs.d/elpa/irony-20170828.1218/server/
    #+END_SRC

    - build and run ~make && ./bin/irony-server --version~

    - cp =irony-server= to your =.emacs.d/bin/=


*Linux*:

The first time you must install the ~irony-server~ by runing the command: ~M-x
irony-install-server~. You may need to re-run it when you =libclang= get
updated.

*** Setup
Install irony-mode from MELPA and add the following to your emacs init file:

#+BEGIN_SRC emacs-lisp
  ;; /irony/+/company-irony/: code completions
  (use-package irony
    :bind (:map irony-mode-map
                ("C-c C-b" . irony-cdb-menu)
                ("C-c =" . irony-get-type))
    :after cc-mode
    :config
    (setq irony--server-executable (expand-file-name
                                      "~/.emacs.d/bin/irony-server"))
    (add-to-list 'irony-additional-clang-options "-std=c++11")
    (add-hook 'c++-mode-hook 'irony-mode)
    (add-hook 'c-mode-hook 'irony-mode)
    (add-hook 'irony-mode-hook 'irony-cdb-autosetup-compile-options))
#+END_SRC
*** Use Irony for C/C++ projects
Like RTags, Irony requires a compilation database. To create one, if using
=cmake=, run the following:

#+BEGIN_SRC sh
  $ cd /path/to/project/build/
  $ cmake -DCMAKE_EXPORT_COMPILE_COMMANDS=1 ..
#+END_SRC

For other C++ projects which aren't CMake-based, use the excellent tool =bear=
to emit the =compile_commands.json= file. It's as easy as:

#+BEGIN_SRC sh
  $ make clean
  $ bear make
#+END_SRC

*** Integrate Irony and Irony-c-headers in Company

To integrate company-mode with Irony and add supports for C++ headers completion,
we use =company-irony= and =company-irony-c-headers= from melpa.
Put the following to your emacs init file:

#+BEGIN_SRC emacs-lisp
  (use-package company-irony
    :config
    (add-hook 'irony-mode-hook 'company-irony-setup-begin-commands)
    (setq company-backends (delete 'company-semantic company-backends))

    (use-package company-irony-c-headers
      :config
      (defun zyue/add-company-backend-irony ()
        (setq-local company-backends
                    (append '((company-irony-c-headers company-irony))
                            company-backends)))
      (add-hook 'c-mode-hook 'zyue/add-company-backend-irony)
      (add-hook 'c++-mode-hook 'zyue/add-company-backend-irony)))
#+END_SRC

*** [optional] Integrate Irony in Ivy

We could also use =ivy/counsel= for completions for Irony, if you prefer Emacs's
default ~complete-symbol~ or ~completion-at-point~ to =company-mode=.

(buggy, not working well)
#+BEGIN_SRC
  (defun add-ivy-irony-mode-hook ()
    (define-key irony-mode-map
      [remap completion-at-point] 'counsel-irony)
    (define-key irony-mode-map
      [remap complete-symbol] 'counsel-irony))
  (add-hook 'irony-mode-hook 'add-ivy-irony-mode-hook)
  (add-hook 'irony-mode-hook 'irony-cdb-autosetup-compile-options)
#+END_SRC

*** [disabled] Show eldoc for C/C++ mode via irony

Enable the minor mode =irony-eldoc=, as well as eldoc-mode. For an example,
place point on top of a symbol, or inside a function call.

#+BEGIN_SRC
  (add-hook 'irony-mode-hook #'irony-eldoc)
#+END_SRC

** Syntax checking with Flycheck
*** Prerequisites

Install =flycheck= from MELPA and add the following to your emacs init file:

#+BEGIN_SRC emacs-lisp
  ;; /flycheck/: syntax checker
  (use-package flycheck
    :config
    (add-hook 'c++-mode-hook 'flycheck-mode)
    (add-hook 'c-mode-hook 'flycheck-mode))
#+END_SRC

***  [disabled] Integrating RTags with Flycheck

To enable RTags and flycheck integration add the following to your emacs init
file:

#+BEGIN_SRC
  (use-package flycheck-rtags
    :config
    (defun zyue/flycheck-rtags-setup ()
      (flycheck-select-checker 'rtags)
      ;; RTags creates more accurate overlays.
      (setq-local flycheck-highlighting-mode nil)
      (setq-local flycheck-check-syntax-automatically nil))
    (add-hook 'c-mode-common-hook #'zyue/flycheck-rtags-setup))
#+END_SRC

*** Integrating Irony with Flycheck

We use =flycheck-irony= from MELPA to perform syntax checking via =irony=:

#+BEGIN_SRC emacs-lisp
  ;; /flycheck-irony/ using /irony/
  (use-package flycheck-irony
    :requires flycheck
    :config
    (eval-after-load 'flycheck
      '(add-hook 'flycheck-mode-hook #'flycheck-irony-setup)))
#+END_SRC

*** Keybindings

- =C-c ! n= and =C-c ! p=: jump to next or previous errors
- =C-c ! l=: list errors
- =C-c ! c=: menually run checker

** CMake automation with cmake-ide (disabled)
