_emacs.d/init/readme/init-cc.html
<div id="outline-container-org9779620" class="outline-4">
<h4 id="org9779620"><span class="section-number-4">1.4.1</span> Installations</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
<b>Mac OS X</b>:
</p>

<p>
Download a pre-compiled package from llvm.org to install <code>irony-server</code>.
(change the 4.0.1 version with the latest (the greatest!))
</p>

<ul class="org-ul">
<li>Download <code>clang+llvm-4.0.1-x86_64-apple-darwin.tar.xz</code> from <a href="http://llvm.org/releases/download.html">http://llvm.org/releases/download.html</a></li>

<li>Extract it somewhere (e.g: <code>~/Programs/</code>) (Warning: you need to keep it on your computer to allow <code>irony-server</code> to work!)</li>

<li>make a clean build directory (e.g. <code>cd ~/tmp &amp;&amp; mkdir build &amp;&amp; cd build</code>)</li>

<li>run</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">cmake -DCMAKE_PREFIX_PATH=/Users/oracleyue/Programs/clang+llvm-4.0.1-x86_64-apple-macosx10.9.0/ -DCMAKE_INSTALL_RPATH_USE_LINK_PATH=ON /Users/oracleyue/.emacs.d/elpa/irony-20170828.1218/server/
</pre>
</div>

<ul class="org-ul">
<li>build and run <code>make &amp;&amp; ./bin/irony-server --version</code></li>

<li>cp <code>irony-server</code> to your <code>.emacs.d/bin/</code></li>
</ul>


<p>
<b>Linux</b>:
</p>

<p>
The first time you must install the <code>irony-server</code> by runing the command: <code>M-x
irony-install-server</code>. You may need to re-run it when you <code>libclang</code> get
updated.
</p>
</div>
</div>

<div id="outline-container-org2878673" class="outline-4">
<h4 id="org2878673"><span class="section-number-4">1.4.2</span> Setup</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
Install irony-mode from MELPA and add the following to your emacs init file:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5C6370;">;; </span><span style="color: #5C6370;">/irony/+/company-irony/: code completions</span>
(<span style="color: #C678DD;">use-package</span> <span style="color: #56B6C2;">irony</span>
  <span style="color: #56B6C2;">:bind</span> (<span style="color: #56B6C2;">:map</span> irony-mode-map
              (<span style="color: #98C379;">"C-c C-b"</span> . irony-cdb-menu)
              (<span style="color: #98C379;">"C-c ="</span> . irony-get-type))
  <span style="color: #56B6C2;">:after</span> cc-mode
  <span style="color: #56B6C2;">:config</span>
  (<span style="color: #C678DD;">setq</span> irony--server-executable (expand-file-name
                                    <span style="color: #98C379;">"~/.emacs.d/bin/irony-server"</span>))
  (add-to-list 'irony-additional-clang-options <span style="color: #98C379;">"-std=c++11"</span>)
  (add-hook 'c++-mode-hook 'irony-mode)
  (add-hook 'c-mode-hook 'irony-mode)
  (add-hook 'irony-mode-hook 'irony-cdb-autosetup-compile-options))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf60648b" class="outline-4">
<h4 id="orgf60648b"><span class="section-number-4">1.4.3</span> Use Irony for C/C++ projects</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
Like RTags, Irony requires a compilation database. To create one, if using
<code>cmake</code>, run the following:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ cd /path/to/project/build/
$ cmake -DCMAKE_EXPORT_COMPILE_COMMANDS=1 ..
</pre>
</div>

<p>
For other C++ projects which aren't CMake-based, use the excellent tool <code>bear</code>
to emit the <code>compile_commands.json</code> file. It's as easy as:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ make clean
$ bear make
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd4f4e6e" class="outline-4">
<h4 id="orgd4f4e6e"><span class="section-number-4">1.4.4</span> Integrate Irony and Irony-c-headers in Company</h4>
<div class="outline-text-4" id="text-1-4-4">
<p>
To integrate company-mode with Irony and add supports for C++ headers completion,
we use <code>company-irony</code> and <code>company-irony-c-headers</code> from melpa.
Put the following to your emacs init file:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #C678DD;">use-package</span> <span style="color: #56B6C2;">company-irony</span>
  <span style="color: #56B6C2;">:config</span>
  (add-hook 'irony-mode-hook 'company-irony-setup-begin-commands)
  (<span style="color: #C678DD;">setq</span> company-backends (delete 'company-semantic company-backends))

  (<span style="color: #C678DD;">use-package</span> <span style="color: #56B6C2;">company-irony-c-headers</span>
    <span style="color: #56B6C2;">:config</span>
    (eval-after-load 'company
      '(add-to-list
        'company-backends '(company-irony-c-headers company-irony)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org9cb3938" class="outline-4">
<h4 id="org9cb3938"><span class="section-number-4">1.4.5</span> [optional] Integrate Irony in Ivy</h4>
<div class="outline-text-4" id="text-1-4-5">
<p>
We could also use <code>ivy/counsel</code> for completions for Irony, if you prefer Emacs's
default <code>complete-symbol</code> or <code>completion-at-point</code> to <code>company-mode</code>.
</p>

<p>
(buggy, not working well)
</p>
<pre class="example">
(defun add-ivy-irony-mode-hook ()
  (define-key irony-mode-map
    [remap completion-at-point] 'counsel-irony)
  (define-key irony-mode-map
    [remap complete-symbol] 'counsel-irony))
(add-hook 'irony-mode-hook 'add-ivy-irony-mode-hook)
(add-hook 'irony-mode-hook 'irony-cdb-autosetup-compile-options)
</pre>
</div>
</div>

<div id="outline-container-org480e9b7" class="outline-4">
<h4 id="org480e9b7"><span class="section-number-4">1.4.6</span> [disabled] Show eldoc for C/C++ mode via irony</h4>
<div class="outline-text-4" id="text-1-4-6">
<p>
Enable the minor mode <code>irony-eldoc</code>, as well as eldoc-mode. For an example,
place point on top of a symbol, or inside a function call.
</p>

<pre class="example">
(add-hook 'irony-mode-hook #'irony-eldoc)
</pre>
</div>
</div>
</div>

<div id="outline-container-org40a865c" class="outline-3">
<h3 id="org40a865c"><span class="section-number-3">1.5</span> Syntax checking with Flycheck</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-org81e0bab" class="outline-4">
<h4 id="org81e0bab"><span class="section-number-4">1.5.1</span> Prerequisites</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
Install <code>flycheck</code> from MELPA and add the following to your emacs init file:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5C6370;">;; </span><span style="color: #5C6370;">/flycheck/: syntax checker</span>
(<span style="color: #C678DD;">use-package</span> <span style="color: #56B6C2;">flycheck</span>
  <span style="color: #56B6C2;">:config</span>
  (add-hook 'c++-mode-hook 'flycheck-mode)
  (add-hook 'c-mode-hook 'flycheck-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org5e5073a" class="outline-4">
<h4 id="org5e5073a"><span class="section-number-4">1.5.2</span> [disabled] Integrating RTags with Flycheck</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
To enable RTags and flycheck integration add the following to your emacs init
file:
</p>

<pre class="example">
(use-package flycheck-rtags
  :config
  (defun y:flycheck-rtags-setup ()
    (flycheck-select-checker 'rtags)
    ;; RTags creates more accurate overlays.
    (setq-local flycheck-highlighting-mode nil)
    (setq-local flycheck-check-syntax-automatically nil))
  (add-hook 'c-mode-common-hook #'y:flycheck-rtags-setup))
</pre>
</div>
</div>

<div id="outline-container-orgd91d03e" class="outline-4">
<h4 id="orgd91d03e"><span class="section-number-4">1.5.3</span> Integrating Irony with Flycheck</h4>
<div class="outline-text-4" id="text-1-5-3">
<p>
We use <code>flycheck-irony</code> from MELPA to perform syntax checking via <code>irony</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5C6370;">;; </span><span style="color: #5C6370;">/flycheck-irony/ using /irony/</span>
(<span style="color: #C678DD;">use-package</span> <span style="color: #56B6C2;">flycheck-irony</span>
  <span style="color: #56B6C2;">:requires</span> flycheck
  <span style="color: #56B6C2;">:config</span>
  (eval-after-load 'flycheck
    '(add-hook 'flycheck-mode-hook #'flycheck-irony-setup)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeb9292e" class="outline-4">
<h4 id="orgeb9292e"><span class="section-number-4">1.5.4</span> Keybindings</h4>
<div class="outline-text-4" id="text-1-5-4">
<ul class="org-ul">
<li><code>C-c ! n</code> and <code>C-c ! p</code>: jump to next or previous errors</li>
<li><code>C-c ! l</code>: list errors</li>
<li><code>C-c ! c</code>: menually run checker</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org502513a" class="outline-3">
<h3 id="org502513a"><span class="section-number-3">1.6</span> CMake automation with cmake-ide (disabled)</h3>
<div class="outline-text-3" id="text-1-6">
</div>
