_emacs.d/init/init-cc.el
(use-package irony
  :bind (:map irony-mode-map
              ("C-c C-b" . irony-cdb-menu)
              ("C-c =" . irony-get-type))
  :after cc-mode
  :config
  (setq irony--server-executable (expand-file-name
                                    "~/.emacs.d/bin/irony-server"))
  (add-to-list 'irony-additional-clang-options "-std=c++11")
  (add-hook 'c++-mode-hook 'irony-mode)
  (add-hook 'c-mode-hook 'irony-mode)
  (add-hook 'irony-mode-hook 'irony-cdb-autosetup-compile-options))

(use-package company-irony
  :config
  (add-hook 'irony-mode-hook 'company-irony-setup-begin-commands)
  (setq company-backends (delete 'company-semantic company-backends))

  (use-package company-irony-c-headers
    :config
    (defun zyue/add-company-backend-irony ()
      (setq-local company-backends
                  (append '((company-irony-c-headers company-irony))
                          company-backends)))
    (add-hook 'c-mode-hook 'zyue/add-company-backend-irony)
    (add-hook 'c++-mode-hook 'zyue/add-company-backend-irony)))

;; /flycheck/: syntax checker
(use-package flycheck
  :config
  (add-hook 'c++-mode-hook 'flycheck-mode)
  (add-hook 'c-mode-hook 'flycheck-mode))

;; /flycheck-irony/ using /irony/
(use-package flycheck-irony
  :requires flycheck
  :config
  (eval-after-load 'flycheck
    '(add-hook 'flycheck-mode-hook #'flycheck-irony-setup)))
