_emacs.d/init/init-cc.org
*** Prerequisites

    Install cmake-ide from MELPA and add the following to your emacs init file:
    #+BEGIN_SRC
      (use-package cmake-ide
        :config
        (cmake-ide-setup))
    #+END_SRC

*** Using cmake-ide

    To have cmake-ide automatically create a compilation commands file in your project root create a =.dir-locals.el= containing the following:
    #+BEGIN_SRC
      ((nil . ((cmake-ide-build-dir . "<PATH_TO_PROJECT_BUILD_DIRECTORY>"))))
    #+END_SRC

    You can now build your project using ~M-x cmake-ide-compile~. Additionally, cmake-ide will automatically update your RTags index as well.

** More supports for C/C++ programming
*** Symbol reference tables via function-args

=function-args= showing an inline arguments hint for the C/C++ function at
point. We particularly use the following two functions: ~moo-jump-local~ and
~moo-jump-directory~, which show a summary/table of C/C++ symbols.

(See https://github.com/abo-abo/function-args for more features. However, I
personally do not use them.)

#+BEGIN_SRC emacs-lisp
  ;; /function-args/: C/C++ symbol reference tables
  ;; usages:
  ;;   =moo-jump-local= "C-M-j", =moo-jump-directory= "C-M-k"
  (when (and *enable-function-args* *enable-semantics*)
    (use-package function-args
      :requires ivy
      :config
      ;; enable case-insensitive searching
      (set-default 'semantic-case-fold t)
      ;; set selection interface
      (if *use-helm*
          (setq moo-select-method 'helm)  ;; ivy, helm, helm-fuzzy
        (setq moo-select-method 'ivy))
      ;; enable function-args
      (add-hook 'c-mode-hook 'fa-config-default)
      (add-hook 'c++-mode-hook 'fa-config-default)
      ;; semantic refresh: "M-x semantic-force-refresh"
      ;; restore default keybindings
      ;; "M-u": fa-abort; "M-o": moo-complete
      (define-key function-args-mode-map (kbd "M-u") 'upcase-word)
      (define-key function-args-mode-map (kbd "M-o") 'open-previous-line)))
#+END_SRC

*** Major modes to edit CMake files

#+BEGIN_SRC emacs-lisp
  (use-package cmake-mode
    ;; /cmake-mode/: cmake-mode.el
    :load-path "~/.emacs.d/git/"
    :config
    ;; /cmake-font-lock/: to add more fontifying features
    (use-package cmake-font-lock
      :load-path "~/.emacs.d/git/cmake-font-lock"
      :config
      (autoload 'cmake-font-lock-activate "cmake-font-lock" nil t)
      (add-hook 'cmake-mode-hook 'cmake-font-lock-activate))
    ;; adding /company-cmake/ for ac-complete
    (add-to-list 'company-dabbrev-code-modes 'cmake-mode)
    (defun zyue/company-cmake-setup ()
      (setq-local company-backends
                  (append '((company-cmake company-dabbrev-code))
                          company-backends)))
    (add-hook 'cmake-mode-hook 'zyue/company-cmake-setup)
    ;; compilation setup for cmake-mode
    (add-hook 'cmake-mode-hook
              (lambda ()
                (setq compile-command "cd build/ && cmake .. && make")
                (define-key cmake-mode-map (kbd "C-c C-c") 'compile))))
#+END_SRC

*** Compilation supports via helm-make

One may use =helm-make= package to run makefile.  To compile the whole project,
use =C-c p c= (=helm-make-projectile=); otherwise, simple run =M-x helm-make= or
=M-x compile=.
#+BEGIN_SRC emacs-lisp
  ;; Compile commands in c/c++ and makefile modes using helm-make
  (use-package helm-make
    :bind (("C-c p c" . helm-make-projectile)
           :map c-mode-base-map
           ("C-c C-c" . helm-make)
           :map makefile-gmake-mode-map   ;; makefile in Linux
           ("C-c C-c" . helm-make)
           :map makefile-bsdmake-mode-map ;; makefile in BSD
           ("C-c C-c" . helm-make)))
#+END_SRC

If the Makefile is in different directories, e.g. created by *cmake*, we need to
specify the location of =Makefile=. =.dir-locals.el= file is needed for this
purpose. =.dir-locals.el= should be placed in project root. The file content
looks like this:

#+BEGIN_SRC
  ((c++-mode (helm-make-build-dir . "build/")))
#+END_SRC
Due to the local variable settings, Emacs will ask if the variable =helm-make-build-dir= is safe. Put the configuration in init file to prevent it.
#+BEGIN_SRC
  (put 'helm-make-build-dir 'safe-local-variable 'stringp)
#+END_SRC

