_emacs.d/init/readme/init-cc.html
<div id="outline-container-org1699bbc" class="outline-4">
<h4 id="org1699bbc"><span class="section-number-4">1.6.1</span> Prerequisites</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
Install cmake-ide from MELPA and add the following to your emacs init file:
</p>
<pre class="example">
(use-package cmake-ide
  :config
  (cmake-ide-setup))
</pre>
</div>
</div>

<div id="outline-container-org8357cbe" class="outline-4">
<h4 id="org8357cbe"><span class="section-number-4">1.6.2</span> Using cmake-ide</h4>
<div class="outline-text-4" id="text-1-6-2">
<p>
To have cmake-ide automatically create a compilation commands file in your project root create a <code>.dir-locals.el</code> containing the following:
</p>
<pre class="example">
((nil . ((cmake-ide-build-dir . "&lt;PATH_TO_PROJECT_BUILD_DIRECTORY&gt;"))))
</pre>

<p>
You can now build your project using <code>M-x cmake-ide-compile</code>. Additionally, cmake-ide will automatically update your RTags index as well.
</p>
</div>
</div>
</div>

<div id="outline-container-org46e36d4" class="outline-3">
<h3 id="org46e36d4"><span class="section-number-3">1.7</span> More supports for C/C++ programming</h3>
<div class="outline-text-3" id="text-1-7">
</div>
<div id="outline-container-orgc5074eb" class="outline-4">
<h4 id="orgc5074eb"><span class="section-number-4">1.7.1</span> Symbol reference tables via function-args</h4>
<div class="outline-text-4" id="text-1-7-1">
<p>
<code>function-args</code> showing an inline arguments hint for the C/C++ function at
point. We particularly use the following two functions: <code>moo-jump-local</code> and
<code>moo-jump-directory</code>, which show a summary/table of C/C++ symbols.
</p>

<p>
(See <a href="https://github.com/abo-abo/function-args">https://github.com/abo-abo/function-args</a> for more features. However, I
personally do not use them.)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5C6370;">;; </span><span style="color: #5C6370;">/function-args/: C/C++ symbol reference tables</span>
<span style="color: #5C6370;">;; </span><span style="color: #5C6370;">usages:</span>
<span style="color: #5C6370;">;;   </span><span style="color: #5C6370;">=moo-jump-local= "C-M-j", =moo-jump-directory= "C-M-k"</span>
(<span style="color: #C678DD;">when</span> (<span style="color: #C678DD;">and</span> *enable-function-args* *enable-semantics*)
  (<span style="color: #C678DD;">use-package</span> <span style="color: #56B6C2;">function-args</span>
    <span style="color: #56B6C2;">:requires</span> ivy
    <span style="color: #56B6C2;">:config</span>
    <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">enable case-insensitive searching</span>
    (set-default 'semantic-case-fold t)
    <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">set selection interface</span>
    (<span style="color: #C678DD;">if</span> *use-helm*
        (<span style="color: #C678DD;">setq</span> moo-select-method 'helm)  <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">ivy, helm, helm-fuzzy</span>
      (<span style="color: #C678DD;">setq</span> moo-select-method 'ivy))
    <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">enable function-args</span>
    (add-hook 'c-mode-hook 'fa-config-default)
    (add-hook 'c++-mode-hook 'fa-config-default)
    <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">semantic refresh: "M-x semantic-force-refresh"</span>
    <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">restore default keybindings</span>
    <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">"M-u": fa-abort; "M-o": moo-complete</span>
    (define-key function-args-mode-map (kbd <span style="color: #98C379;">"M-u"</span>) 'upcase-word)
    (define-key function-args-mode-map (kbd <span style="color: #98C379;">"M-o"</span>) 'open-previous-line)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbbeb805" class="outline-4">
<h4 id="orgbbeb805"><span class="section-number-4">1.7.2</span> Major modes to edit CMake files</h4>
<div class="outline-text-4" id="text-1-7-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #C678DD;">use-package</span> <span style="color: #56B6C2;">cmake-mode</span>
  <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">/cmake-mode/: cmake-mode.el</span>
  <span style="color: #56B6C2;">:load-path</span> <span style="color: #98C379;">"~/.emacs.d/git/"</span>
  <span style="color: #56B6C2;">:config</span>
  <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">/cmake-font-lock/: to add more fontifying features</span>
  (<span style="color: #C678DD;">use-package</span> <span style="color: #56B6C2;">cmake-font-lock</span>
    <span style="color: #56B6C2;">:load-path</span> <span style="color: #98C379;">"~/.emacs.d/git/cmake-font-lock"</span>
    <span style="color: #56B6C2;">:config</span>
    (autoload 'cmake-font-lock-activate <span style="color: #98C379;">"cmake-font-lock"</span> nil t)
    (add-hook 'cmake-mode-hook 'cmake-font-lock-activate))
  <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">adding /company-cmake/ for ac-complete</span>
  (add-to-list 'company-dabbrev-code-modes 'cmake-mode)
  (<span style="color: #C678DD;">defun</span> <span style="color: #61AFEF;">y:company-cmake-setup</span> ()
    (<span style="color: #C678DD;">setq-local</span> company-backends
                (append '((company-cmake company-dabbrev-code))
                        company-backends)))
  (add-hook 'cmake-mode-hook 'y:company-cmake-setup)
  <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">compilation setup for cmake-mode</span>
  (add-hook 'cmake-mode-hook
            (<span style="color: #C678DD;">lambda</span> ()
              (<span style="color: #C678DD;">setq</span> compile-command <span style="color: #98C379;">"cd build/ &amp;&amp; cmake .. &amp;&amp; make"</span>)
              (define-key cmake-mode-map (kbd <span style="color: #98C379;">"C-c C-c"</span>) 'compile))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb216c61" class="outline-4">
<h4 id="orgb216c61"><span class="section-number-4">1.7.3</span> Compilation supports via helm-make</h4>
<div class="outline-text-4" id="text-1-7-3">
<p>
One may use <code>helm-make</code> package to run makefile.  To compile the whole project,
use <code>C-c p c</code> (<code>helm-make-projectile</code>); otherwise, simple run <code>M-x helm-make</code> or
<code>M-x compile</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5C6370;">;; </span><span style="color: #5C6370;">Compile commands in c/c++ and makefile modes using helm-make</span>
(<span style="color: #C678DD;">use-package</span> <span style="color: #56B6C2;">helm-make</span>
  <span style="color: #56B6C2;">:bind</span> ((<span style="color: #98C379;">"C-c p c"</span> . helm-make-projectile)
         <span style="color: #56B6C2;">:map</span> c-mode-base-map
         (<span style="color: #98C379;">"C-c C-c"</span> . helm-make)
         <span style="color: #56B6C2;">:map</span> makefile-gmake-mode-map   <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">makefile in Linux</span>
         (<span style="color: #98C379;">"C-c C-c"</span> . helm-make)
         <span style="color: #56B6C2;">:map</span> makefile-bsdmake-mode-map <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">makefile in BSD</span>
         (<span style="color: #98C379;">"C-c C-c"</span> . helm-make)))
</pre>
</div>

<p>
If the Makefile is in different directories, e.g. created by <b>cmake</b>, we need to
specify the location of <code>Makefile</code>. <code>.dir-locals.el</code> file is needed for this
purpose. <code>.dir-locals.el</code> should be placed in project root. The file content
looks like this:
</p>

<pre class="example">
((c++-mode (helm-make-build-dir . "build/")))
</pre>
<p>
Due to the local variable settings, Emacs will ask if the variable <code>helm-make-build-dir</code> is safe. Put the configuration in init file to prevent it.
</p>
<pre class="example">
(put 'helm-make-build-dir 'safe-local-variable 'stringp)
</pre>
</div>
</div>
