_emacs.d/init/init-cc.el

;; /function-args/: C/C++ symbol reference tables
;; usages:
;;   =moo-jump-local= "C-M-j", =moo-jump-directory= "C-M-k"
(when (and *enable-function-args* *enable-semantics*)
  (use-package function-args
    :requires ivy
    :config
    ;; enable case-insensitive searching
    (set-default 'semantic-case-fold t)
    ;; set selection interface
    (if *use-helm*
        (setq moo-select-method 'helm)  ;; ivy, helm, helm-fuzzy
      (setq moo-select-method 'ivy))
    ;; enable function-args
    (add-hook 'c-mode-hook 'fa-config-default)
    (add-hook 'c++-mode-hook 'fa-config-default)
    ;; semantic refresh: "M-x semantic-force-refresh"
    ;; restore default keybindings
    ;; "M-u": fa-abort; "M-o": moo-complete
    (define-key function-args-mode-map (kbd "M-u") 'upcase-word)
    (define-key function-args-mode-map (kbd "M-o") 'open-previous-line)))

(use-package cmake-mode
  ;; /cmake-mode/: cmake-mode.el
  :defer t
  :config
  ;; /cmake-font-lock/: to add more fontifying features
  (use-package cmake-font-lock
    :load-path "~/.emacs.d/git/cmake-font-lock"
    :config
    (autoload 'cmake-font-lock-activate "cmake-font-lock" nil t)
    (add-hook 'cmake-mode-hook 'cmake-font-lock-activate))
  ;; adding /company-cmake/ for ac-complete
  (add-to-list 'company-dabbrev-code-modes 'cmake-mode)
  (defun zyue/company-cmake-setup ()
    (setq-local company-backends
                (append '((company-cmake company-dabbrev-code))
                        company-backends)))
  (add-hook 'cmake-mode-hook 'zyue/company-cmake-setup)
  ;; compilation setup for cmake-mode
  (add-hook 'cmake-mode-hook
            (lambda ()
              (setq compile-command "cd build/ && cmake .. && make")
              (define-key cmake-mode-map (kbd "C-c C-c") 'compile))))

;; Compile commands in c/c++ and makefile modes using helm-make
(use-package helm-make
  :bind (("C-c p c" . helm-make-projectile)
         :map c-mode-base-map
         ("C-c C-c" . helm-make)
         :map makefile-gmake-mode-map   ;; makefile in Linux
         ("C-c C-c" . helm-make)
         :map makefile-bsdmake-mode-map ;; makefile in BSD
         ("C-c C-c" . helm-make)))

(provide 'init-cc)
;; ================================================
