_emacs.d/init/init-cc.org
*** Major modes for doxygen documentations (disabled)
To use =doxymacs=, setup the following in your init file:

#+BEGIN_SRC
  ;; /doxymacs/ to manipulate doxygen documentations
  (add-to-list 'load-path "~/.emacs.d/git/doxymacs-1.8.0")
  (require 'doxymacs)
  (add-hook 'c-mode-common-hook 'doxymacs-mode)
  ; fontify the doxygen keywords
  (defun my-doxymacs-font-lock-hook ()
    (if (or (eq major-mode 'c-mode) (eq major-mode 'c++-mode))
        (doxymacs-font-lock)))
  (add-hook 'font-lock-mode-hook 'my-doxymacs-font-lock-hook)
#+END_SRC

** Ends

#+BEGIN_SRC emacs-lisp
  (provide 'init-cc)
  ;; ================================================
  ;; init-cc.el ends here
#+END_SRC
