_emacs.d/init/readme/init-cc.html

<div id="outline-container-org03db091" class="outline-4">
<h4 id="org03db091"><span class="section-number-4">1.7.4</span> Major modes for doxygen documentations (disabled)</h4>
<div class="outline-text-4" id="text-1-7-4">
<p>
To use <code>doxymacs</code>, setup the following in your init file:
</p>

<pre class="example">
;; /doxymacs/ to manipulate doxygen documentations
(add-to-list 'load-path "~/.emacs.d/git/doxymacs-1.8.0")
(require 'doxymacs)
(add-hook 'c-mode-common-hook 'doxymacs-mode)
; fontify the doxygen keywords
(defun my-doxymacs-font-lock-hook ()
  (if (or (eq major-mode 'c-mode) (eq major-mode 'c++-mode))
      (doxymacs-font-lock)))
(add-hook 'font-lock-mode-hook 'my-doxymacs-font-lock-hook)
</pre>
</div>
</div>
</div>

<div id="outline-container-org895fe5e" class="outline-3">
<h3 id="org895fe5e"><span class="section-number-3">1.8</span> Ends</h3>
<div class="outline-text-3" id="text-1-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #C678DD;">provide</span> '<span style="color: #56B6C2;">init-cc</span>)
<span style="color: #5C6370;">;; </span><span style="color: #5C6370;">================================================</span>
<span style="color: #5C6370;">;; </span><span style="color: #5C6370;">init-cc.el ends here</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 20 Apr 2018</p>
<p class="author">Author: Zuogong Yue</p>
<p class="date">Created: 2018-05-03 Thu 22:27</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>