_emacs.d/init/init-cc.el
;; init-cc.el ends here
